# GetSlabPreferencesStyle

## Description
Gets the Slab Style of the Slab Preferences.

```pascal
FUNCTION GetSlabPreferencesStyle : LONGINT;
```

```python
def vs.GetSlabPreferencesStyle():
    return LONGINT
```

## See Also
VS Functions:
SetSlabPreferencesStyle

## Version
Availability: from Vectorworks 2011

## Category
* Objects - Architectural